cases/test/0/air/epsField
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.005/air";
    object      epsField;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    air_left
    {
        type            calculated;
        value           uniform 1;
    }
    air_up
    {
        type            calculated;
        value           uniform 1;
    }
    air_right
    {
        type            calculated;
        value           uniform 1;
    }
    actuator1_surface
    {
        type            calculated;
        value           uniform 1;
    }
    zfaces
    {
        type            empty;
    }
    air_to_solid
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
