cases/test/0/air/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    air_left
    {
        type            advective;
        value           uniform 0;
    }
    air_up
    {
        type            advective;
        value           uniform 0;
    }
    air_right
    {
        type            advective;
        value           uniform 0;
    }
    actuator1_surface
    {
        type            zeroGradient;
    }
    zfaces
    {
        type            empty;
    }
    air_to_solid
    {
        type            zeroGradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
