cases/test/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.005";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    air_left
    {
        type            advective;
    }
    air_up
    {
        type            advective;
    }
    air_right
    {
        type            advective;
    }
    solid_left
    {
        type            fixedValue;
        value           uniform 0;
    }
    solid_bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    solid_right
    {
        type            fixedValue;
        value           uniform 0;
    }
    actuator1_surface
    {
        type            zeroGradient;
    }
    actuator2_surface
    {
        type            fixedValue;
        value           uniform 0;
    }
    zfaces
    {
        type            empty;
    }
}


// ************************************************************************* //
