cases/test/constant/userDefinedParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      userDefinedParameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// permitivity of free space
eps0        [-1 -3 4 0 0 2 0]   8.854187817E-12;

// amplitude of electric potential input
// (dimension [V] has already been hard coded)
epMax       [0 0 0 0 0 0 0]     5E3;

// amplitude of charge density input 
// (dimension [C / m^3] has already been hard coded)
rhocMax     [0 0 0 0 0 0 0]     7.5E-3;


// frequency of input sine signal 
omega       [0 0 -1 0 0 0 0]    4.5E3;

// ************************************************************************* //
