cases/test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    ep
    {
        solver          PCG;
        preconditioner  FDIC; 
        //{
        //    preconditioner      GAMG;
        //    smoother        DICGaussSeidel;
        //    tolerance       1e-03;
        //    relTol          0;
        //    nPreSweeps      0;
        //    nPostSweeps     2;
        //    nFinestSweeps   2;
        //    cachedAgglomeration     true;
        //    nCellsInCoarsetLevel    10;
        //    agglomerator    faceAreaPair;
        //    mergeLevels     1;
        //}
        tolerance       1e-08;
        relTol          0;
        maxIter         5000;
    }

    rhoc
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-08;
        relTol          0;
        maxIter         5000;
    }
    
    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0;
        maxIter         5000;
    }

    p
    {
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-08;
        relTol          0;
        maxIter         5000;
    }
}

PISO
{
    nCorrector  2;
    nNonOrthogonalCorrectors 0;
    pRefCell    0;
    pRefValue   0;
}

// ************************************************************************* //
